In [1]:
height = '4.7'
height = height.split('.')
height

['4', '7']

In [2]:
feet_to_metre = (int) (height[0])*0.3048
feet_to_metre

1.2192

In [3]:
inchie_to_metre = (int) (height[1])*0.0254
inchie_to_metre

0.17779999999999999

In [4]:
metre = feet_to_metre+inchie_to_metre
metre

1.397

In [5]:
#convert height
def convert_to_metre(height):
    height = height.split('.')
    feet_to_metre = (int) (height[0])*0.3048
    inchie_to_metre = (int) (height[1])*0.0254
    return feet_to_metre+inchie_to_metre

In [6]:
convert_to_metre(str(4.7))

1.397

In [7]:
type(convert_to_metre(str(4.7)))

float

In [9]:
#calculate BMI
height = input()
weight = input()
bmi = round((float (weight) / convert_to_metre(height)**2),2)
if bmi <= 18.5:
    print("underweight.")
elif 18.5 < bmi <= 24.9:
    print("normal.")
elif 25 < bmi <= 29.29:
    print("overweight.")
else:
    print("obese.")

4.7
55

In [25]:
import pandas as pd
df = pd.read_csv('aaa.csv')
df

,Unnamed: 0,location,size,total_sqft,bath,balcony,price
0,0,Electronic City Phase II,2 BHK,1056,2,1,39.07
1,1,Chikka Tirupathi,4 Bedroom,2600,5,3,120.00
2,0,NagaLand,2 BHK,1055,2,1,29.70

In [18]:
add = {
    'location': ['NagaLand'],
    'size': ['2 BHK'],
    'total_sqft': [1055],
    'bath': [2],
    'balcony': [1],
    'price': [29.7]
}
add

{'location': ['NagaLand'],
 'size': ['2 BHK'],
 'total_sqft': [1055],
 'bath': [2],
 'balcony': [1],
 'price': [29.7]}

In [20]:
df2 = pd.DataFrame(add)
df2

   location   size  total_sqft  bath  balcony  price
0  NagaLand  2 BHK        1055     2        1   29.7

In [38]:
df3 = pd.concat([df,df2], axis=0, join='inner')
df3

                   location       size  total_sqft  bath  balcony   price
0  Electronic City Phase II      2 BHK        1056     2        1   39.07
1          Chikka Tirupathi  4 Bedroom        2600     5        3  120.00
2                  NagaLand      2 BHK        1055     2        1   29.70
0                  NagaLand      2 BHK        1055     2        1   29.70

In [24]:
df3.to_csv('aaa.csv')

In [26]:
data = {
    'Age':[],
    'Height':[],
    'Weight':[],
    'BMI':[],
    'Blood Group ( is Negative?)':[],
    'Delivery Type':[],
    'Systolic Blood Pressure':[],
    'Diastolic Blood Pressure':[],
    'Edema':[],
    'Anemia':[],
    'Jaundice':[],
    'Diabetes':[],
    'Risk':[]    
}

In [27]:
data

{'Age': [],
 'Height': [],
 'Weight': [],
 'BMI': [],
 'Blood Group ( is Negative?)': [],
 'Delivery Type': [],
 'Systolic Blood Pressure': [],
 'Diastolic Blood Pressure': [],
 'Edema': [],
 'Anemia': [],
 'Jaundice': [],
 'Diabetes': [],
 'Risk': []}

In [40]:
#pd.DataFrame(data).to_csv('Pregnancy Risk.csv')